## Plan Result (pocket-event-bridge-cdk)

[CI link](https://circleci.com/gh/Pocket/pocket-monorepo/197036)



<pre><code>Plan: 0 to add, 67 to change, 0 to destroy.</code></pre>

* Update
  * aws_cloudwatch_event_bus.shared-event-bus_event-bus-PocketEventBridge-Prod-Shared-Event-Bus_AA9ACCF5
  * aws_cloudwatch_event_rule.adm-events_PocketEventBridge-Prod-EventTracker-EventBridge-Rule_event-bridge-rule_5E518227
  * aws_cloudwatch_event_rule.adm-events_PocketEventBridge-Prod-UserMerge-EventBridge-Rule_event-bridge-rule_6FA6D274
  * aws_cloudwatch_event_rule.all-events_PocketEventBridge-Prod-AllEvents-EventBridge-Rule_event-bridge-rule_080532DD
  * aws_cloudwatch_event_rule.collection-events_PocketEventBridge-Prod-Collection-Api-EventBridge-Rule_event-bridge-rule_D5C5DE9D
  * aws_cloudwatch_event_rule.forgot-password_PocketEventBridge-Prod-ForgotPasswordRequest-EventBridge-Rule_event-bridge-rule_92A00BED
  * aws_cloudwatch_event_rule.list-api-events_PocketEventBridge-Prod-List-Api-EventBridge-Rule_event-bridge-rule_AFDFFFC6
  * aws_cloudwatch_event_rule.premium-purchase_PocketEventBridge-Prod-PremiumPurchase-EventBridge-Rule_event-bridge-rule_ECCD1C94
  * aws_cloudwatch_event_rule.prospect-events_PocketEventBridge-Prod-Prospect-Dismiss-Prod-EventBridge-Rule_event-bridge-rule_758CF81E
  * aws_cloudwatch_event_rule.prospect-events_PocketEventBridge-Prod-Prospect-Prod-EventBridge-Rule_event-bridge-rule_D94A5C82
  * aws_cloudwatch_event_rule.shareable-list-events_PocketEventBridge-Prod-Shareable-List-EventBridge-Rule_event-bridge-rule_B3E9B53D
  * aws_cloudwatch_event_rule.shareable-list-item-events_PocketEventBridge-Prod-Shareable-List-Item-EventBridge-Rule_event-bridge-rule_8124CBA8
  * aws_cloudwatch_event_rule.shares-api-events_PocketEventBridge-Prod-SharesApi-EventBridge-Rule_event-bridge-rule_9837A402
  * aws_cloudwatch_event_rule.user-api-events_PocketEventBridge-Prod-User-Api-EventBridge-Rule_event-bridge-rule_4810C8AC
  * aws_cloudwatch_event_rule.user-registration_PocketEventBridge-Prod-User-Registration-EventBridge-Rule_event-bridge-rule_99FC7731
  * aws_cloudwatch_log_group.all-events_all-event-log-group_7F02C8C4
  * aws_cloudwatch_metric_alarm.adm-events_pocketeventbridge-prod-dlq-alarm_D899FDCA
  * aws_cloudwatch_metric_alarm.collection-events_collectionevents-rule-dlq-alarm_9543404D
  * aws_cloudwatch_metric_alarm.forgot-password_forgotpasswordrequest-rule-dlq-alarm_EAFB02F7
  * aws_cloudwatch_metric_alarm.list-api-events_listapievents-rule-dlq-alarm_9E16078F
  * aws_cloudwatch_metric_alarm.premium-purchase_premiumpurchase-rule-dlq-alarm_912E47A2
  * aws_cloudwatch_metric_alarm.prospect-events_prospectevents-rule-dlq-alarm_8841D120
  * aws_cloudwatch_metric_alarm.shareable-list-events_shareablelistevents-rule-dlq-alarm_FBCFA70C
  * aws_cloudwatch_metric_alarm.shareable-list-item-events_shareablelistitemevents-rule-dlq-alarm_0C71CDFB
  * aws_cloudwatch_metric_alarm.shares-api-events_sharesapievents-rule-dlq-alarm_89927093
  * aws_cloudwatch_metric_alarm.user-api-events_userevents-rule-dlq-alarm_A6972B78
  * aws_schemas_schema.forgot-password-request-event-schema_Forgot-Password-Request-Schema_F8AD6D8D
  * aws_schemas_schema.premium-purchase-event-schema_Premium-Purchase-Schema_4B186F59
  * aws_schemas_schema.premium-purchase-event-schema_Premium-Renewal-Upcoming-Schema_8D7B8419
  * aws_schemas_schema.queue-delete-schema_cron1510-schema_D11DCA60
  * aws_schemas_schema.user-api-events-schema_user-events-schema_692DDC33
  * aws_schemas_schema.user-merge-event-shema_user-merge-schema_325E4B6B
  * aws_schemas_schema.user-registration-event-schema_User-Registration-Event-Schema_ABDCA1C3
  * aws_sns_topic.adm-events_user-merge-topic_59FD8EDC
  * aws_sns_topic.collection-events_collection-event-topic_343F754D
  * aws_sns_topic.forgot-password_forgot-password-topic_37468B69
  * aws_sns_topic.list-api-events_list-event-topic_8792A1B3
  * aws_sns_topic.pagerduty_alarm-critical-topic_F1534579
  * aws_sns_topic.pagerduty_alarm-non-critical-topic_53C1A3B3
  * aws_sns_topic.premium-purchase_premium-purchase-topic_B49B01E4
  * aws_sns_topic.prospect-events_prospect-event-topic_59EF07AC
  * aws_sns_topic.shareable-list-events_shareable-list-event-topic_0122F098
  * aws_sns_topic.shareable-list-item-events_shareable-list-item-event-topic_C6825838
  * aws_sns_topic.shares-api-events_shares-api-event-topic_E9F56597
  * aws_sns_topic.user-api-events_user-event-topic_BF85AC87
  * aws_sns_topic.user-registration_user-registration-topic_1A7AE012
  * aws_sns_topic_policy.adm-events_user-events-sns-topic-policy_311E9FD7
  * aws_sns_topic_policy.collection-events_collection-events-sns-topic-policy_65FE0430
  * aws_sns_topic_policy.forgot-password_forgot-password-sns-topic-policy_32893F3B
  * aws_sns_topic_policy.list-api-events_list-events-sns-topic-policy_59B53E09
  * aws_sns_topic_policy.premium-purchase_premium-purchase-sns-topic-policy_DDFFEF7C
  * aws_sns_topic_policy.prospect-events_prospect-events-sns-topic-policy_8C3D6AD1
  * aws_sns_topic_policy.shareable-list-events_shareable-list-events-sns-topic-policy_1352CBFE
  * aws_sns_topic_policy.shareable-list-item-events_shareable-list-item-events-sns-topic-policy_7C39759F
  * aws_sns_topic_policy.shares-api-events_sharesapi-events-sns-topic-policy_32A6E4FF
  * aws_sns_topic_policy.user-api-events_user-events-sns-topic-policy_0B7C8128
  * aws_sns_topic_policy.user-registration_user-registration-events-sns-topic-policy_15EC0C3C
  * aws_sqs_queue.adm-events_sns-topic-dql_3950AFFB
  * aws_sqs_queue.collection-events_sns-topic-dql_48DE5FA3
  * aws_sqs_queue.forgot-password_sns-topic-dlq_A55BE032
  * aws_sqs_queue.list-api-events_sns-topic-dql_ED0C2F54
  * aws_sqs_queue.premium-purchase_sns-topic-dlq_2D01673E
  * aws_sqs_queue.shareable-list-events_sns-topic-dql_91DFF5B3
  * aws_sqs_queue.shareable-list-item-events_sns-topic-dql_44435A2F
  * aws_sqs_queue.shares-api-events_sns-topic-dql_E0EEF171
  * aws_sqs_queue.user-api-events_sns-topic-dql_D6161F53
  * aws_sqs_queue.user-registration_sns-topic-dql_811A5411



<details><summary>Change Result (Click me)</summary>

```hcl

  # data.aws_iam_policy_document.adm-events_PocketEventBridge-Prod-EventBridge-SNS-Policy_69DF8795 will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "adm-events_PocketEventBridge-Prod-EventBridge-SNS-Policy_69DF8795" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "sns:Publish",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-UserMerge-Topic",
            ]

          + principals {
              + identifiers = [
                  + "events.amazonaws.com",
                ]
              + type        = "Service"
            }
        }
    }

  # data.aws_iam_policy_document.collection-events_PocketEventBridge-Prod-EventBridge-SNS-Policy_71D8FE56 will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "collection-events_PocketEventBridge-Prod-EventBridge-SNS-Policy_71D8FE56" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "sns:Publish",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-CollectionEventTopic",
            ]

          + principals {
              + identifiers = [
                  + "events.amazonaws.com",
                ]
              + type        = "Service"
            }
        }
    }

  # data.aws_iam_policy_document.forgot-password_PocketEventBridge-Prod-EventBridge-SNS-Policy_62532DF2 will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "forgot-password_PocketEventBridge-Prod-EventBridge-SNS-Policy_62532DF2" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "sns:Publish",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-ForgotPasswordRequest-Topic",
            ]

          + principals {
              + identifiers = [
                  + "events.amazonaws.com",
                ]
              + type        = "Service"
            }
        }
    }

  # data.aws_iam_policy_document.list-api-events_PocketEventBridge-Prod-EventBridge-SNS-Policy_87C8D81F will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "list-api-events_PocketEventBridge-Prod-EventBridge-SNS-Policy_87C8D81F" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "sns:Publish",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-ListEventTopic",
            ]

          + principals {
              + identifiers = [
                  + "events.amazonaws.com",
                ]
              + type        = "Service"
            }
        }
    }

  # data.aws_iam_policy_document.premium-purchase_PocketEventBridge-Prod-EventBridge-SNS-Policy_ABFB117B will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "premium-purchase_PocketEventBridge-Prod-EventBridge-SNS-Policy_ABFB117B" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "sns:Publish",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-PremiumPurchase-Topic",
            ]

          + principals {
              + identifiers = [
                  + "events.amazonaws.com",
                ]
              + type        = "Service"
            }
        }
    }

  # data.aws_iam_policy_document.prospect-events_PocketEventBridge-Prod-EventBridge-SNS-Policy_9EB3E664 will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "prospect-events_PocketEventBridge-Prod-EventBridge-SNS-Policy_9EB3E664" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "sns:Publish",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-ProspectEventTopic",
            ]

          + principals {
              + identifiers = [
                  + "events.amazonaws.com",
                ]
              + type        = "Service"
            }
        }
    }

  # data.aws_iam_policy_document.shareable-list-events_PocketEventBridge-Prod-EventBridge-SNS-Policy_01EB0FFC will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "shareable-list-events_PocketEventBridge-Prod-EventBridge-SNS-Policy_01EB0FFC" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "sns:Publish",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-ShareableListEventTopic",
            ]

          + principals {
              + identifiers = [
                  + "events.amazonaws.com",
                ]
              + type        = "Service"
            }
        }
    }

  # data.aws_iam_policy_document.shareable-list-item-events_PocketEventBridge-Prod-EventBridge-SNS-Policy_DD089E8F will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "shareable-list-item-events_PocketEventBridge-Prod-EventBridge-SNS-Policy_DD089E8F" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "sns:Publish",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-ShareableListItemEventTopic",
            ]

          + principals {
              + identifiers = [
                  + "events.amazonaws.com",
                ]
              + type        = "Service"
            }
        }
    }

  # data.aws_iam_policy_document.shares-api-events_PocketEventBridge-Prod-EventBridge-SNS-Policy_5B92A5DA will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "shares-api-events_PocketEventBridge-Prod-EventBridge-SNS-Policy_5B92A5DA" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "sns:Publish",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-SharesApiEventTopic",
            ]

          + principals {
              + identifiers = [
                  + "events.amazonaws.com",
                ]
              + type        = "Service"
            }
        }
    }

  # data.aws_iam_policy_document.user-api-events_PocketEventBridge-Prod-EventBridge-SNS-Policy_CC884446 will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "user-api-events_PocketEventBridge-Prod-EventBridge-SNS-Policy_CC884446" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "sns:Publish",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-UserEventTopic",
            ]

          + principals {
              + identifiers = [
                  + "events.amazonaws.com",
                ]
              + type        = "Service"
            }
        }
    }

  # data.aws_iam_policy_document.user-registration_PocketEventBridge-Prod-EventBridge-SNS-Policy_85B528ED will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "user-registration_PocketEventBridge-Prod-EventBridge-SNS-Policy_85B528ED" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "sns:Publish",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-UserRegistrationTopic",
            ]

          + principals {
              + identifiers = [
                  + "events.amazonaws.com",
                ]
              + type        = "Service"
            }
        }
    }

  # aws_cloudwatch_event_bus.shared-event-bus_event-bus-PocketEventBridge-Prod-Shared-Event-Bus_AA9ACCF5 will be updated in-place
  ~ resource "aws_cloudwatch_event_bus" "shared-event-bus_event-bus-PocketEventBridge-Prod-Shared-Event-Bus_AA9ACCF5" {
        id       = "PocketEventBridge-Prod-Shared-Event-Bus"
        name     = "PocketEventBridge-Prod-Shared-Event-Bus"
      ~ tags     = {
          + "app_code"       = "pocket-content-shared"
          + "component_code" = "pocket-content-shared-pocketeventbridge"
            "costCenter"     = "Shared"
          + "env_code"       = "prod"
            "environment"    = "Prod"
            "owner"          = "Pocket"
            "service"        = "PocketEventBridge"
        }
      ~ tags_all = {
          + "app_code"       = "pocket-content-shared"
          + "component_code" = "pocket-content-shared-pocketeventbridge"
          + "env_code"       = "prod"
            # (4 unchanged elements hidden)
        }
        # (1 unchanged attribute hidden)
    }

  # aws_cloudwatch_event_rule.adm-events_PocketEventBridge-Prod-EventTracker-EventBridge-Rule_event-bridge-rule_5E518227 will be updated in-place
  ~ resource "aws_cloudwatch_event_rule" "adm-events_PocketEventBridge-Prod-EventTracker-EventBridge-Rule_event-bridge-rule_5E518227" {
        id                  = "PocketEventBridge-Prod-EventTracker-Rule-Rule"
        name                = "PocketEventBridge-Prod-EventTracker-Rule-Rule"
        tags                = {}
      ~ tags_all            = {
          + "app_code"       = "pocket-content-shared"
          + "component_code" = "pocket-content-shared-pocketeventbridge"
          + "env_code"       = "prod"
            # (4 unchanged elements hidden)
        }
        # (9 unchanged attributes hidden)
    }

  # aws_cloudwatch_event_rule.adm-events_PocketEventBridge-Prod-UserMerge-EventBridge-Rule_event-bridge-rule_6FA6D274 will be updated in-place
  ~ resource "aws_cloudwatch_event_rule" "adm-events_PocketEventBridge-Prod-UserMerge-EventBridge-Rule_event-bridge-rule_6FA6D274" {
        id                  = "PocketEventBridge-Prod-Shared-Event-Bus/PocketEventBridge-Prod-UserMerge-Rule-Rule"
        name                = "PocketEventBridge-Prod-UserMerge-Rule-Rule"
        tags                = {}
      ~ tags_all            = {
          + "app_code"       = "pocket-content-shared"
          + "component_code" = "pocket-content-shared-pocketeventbridge"
          + "env_code"       = "prod"
            # (4 unchanged elements hidden)
        }
        # (10 unchanged attributes hidden)
    }

  # aws_cloudwatch_event_rule.all-events_PocketEventBridge-Prod-AllEvents-EventBridge-Rule_event-bridge-rule_080532DD will be updated in-place
  ~ resource "aws_cloudwatch_event_rule" "all-events_PocketEventBridge-Prod-AllEvents-EventBridge-Rule_event-bridge-rule_080532DD" {
        id                  = "PocketEventBridge-Prod-Shared-Event-Bus/PocketEventBridge-Prod-AllEvents-Rule-Rule"
        name                = "PocketEventBridge-Prod-AllEvents-Rule-Rule"
        tags                = {}
      ~ tags_all            = {
          + "app_code"       = "pocket-content-shared"
          + "component_code" = "pocket-content-shared-pocketeventbridge"
          + "env_code"       = "prod"
            # (4 unchanged elements hidden)
        }
        # (10 unchanged attributes hidden)
    }

  # aws_cloudwatch_event_rule.collection-events_PocketEventBridge-Prod-Collection-Api-EventBridge-Rule_event-bridge-rule_D5C5DE9D will be updated in-place
  ~ resource "aws_cloudwatch_event_rule" "collection-events_PocketEventBridge-Prod-Collection-Api-EventBridge-Rule_event-bridge-rule_D5C5DE9D" {
        id                  = "PocketEventBridge-Prod-Shared-Event-Bus/PocketEventBridge-Prod-CollectionEvents-Rule-Rule"
        name                = "PocketEventBridge-Prod-CollectionEvents-Rule-Rule"
        tags                = {}
      ~ tags_all            = {
          + "app_code"       = "pocket-content-shared"
          + "component_code" = "pocket-content-shared-pocketeventbridge"
          + "env_code"       = "prod"
            # (4 unchanged elements hidden)
        }
        # (10 unchanged attributes hidden)
    }

  # aws_cloudwatch_event_rule.forgot-password_PocketEventBridge-Prod-ForgotPasswordRequest-EventBridge-Rule_event-bridge-rule_92A00BED will be updated in-place
  ~ resource "aws_cloudwatch_event_rule" "forgot-password_PocketEventBridge-Prod-ForgotPasswordRequest-EventBridge-Rule_event-bridge-rule_92A00BED" {
        id                  = "PocketEventBridge-Prod-Shared-Event-Bus/PocketEventBridge-Prod-ForgotPasswordRequest-Rule-Rule"
        name                = "PocketEventBridge-Prod-ForgotPasswordRequest-Rule-Rule"
      ~ tags                = {
          + "app_code"       = "pocket-content-shared"
          + "component_code" = "pocket-content-shared-pocketeventbridge"
            "costCenter"     = "Shared"
          + "env_code"       = "prod"
            "environment"    = "Prod"
            "owner"          = "Pocket"
            "service"        = "PocketEventBridge"
        }
      ~ tags_all            = {
          + "app_code"       = "pocket-content-shared"
          + "component_code" = "pocket-content-shared-pocketeventbridge"
          + "env_code"       = "prod"
            # (4 unchanged elements hidden)
        }
        # (10 unchanged attributes hidden)
    }

  # aws_cloudwatch_event_rule.list-api-events_PocketEventBridge-Prod-List-Api-EventBridge-Rule_event-bridge-rule_AFDFFFC6 will be updated in-place
  ~ resource "aws_cloudwatch_event_rule" "list-api-events_PocketEventBridge-Prod-List-Api-EventBridge-Rule_event-bridge-rule_AFDFFFC6" {
        id                  = "PocketEventBridge-Prod-Shared-Event-Bus/PocketEventBridge-Prod-ListApiEvents-Rule-Rule"
        name                = "PocketEventBridge-Prod-ListApiEvents-Rule-Rule"
        tags                = {}
      ~ tags_all            = {
          + "app_code"       = "pocket-content-shared"
          + "component_code" = "pocket-content-shared-pocketeventbridge"
          + "env_code"       = "prod"
            # (4 unchanged elements hidden)
        }
        # (10 unchanged attributes hidden)
    }

  # aws_cloudwatch_event_rule.premium-purchase_PocketEventBridge-Prod-PremiumPurchase-EventBridge-Rule_event-bridge-rule_ECCD1C94 will be updated in-place
  ~ resource "aws_cloudwatch_event_rule" "premium-purchase_PocketEventBridge-Prod-PremiumPurchase-EventBridge-Rule_event-bridge-rule_ECCD1C94" {
        id                  = "PocketEventBridge-Prod-Shared-Event-Bus/PocketEventBridge-Prod-PremiumPurchase-Rule-Rule"
        name                = "PocketEventBridge-Prod-PremiumPurchase-Rule-Rule"
        tags                = {}
      ~ tags_all            = {
          + "app_code"       = "pocket-content-shared"
          + "component_code" = "pocket-content-shared-pocketeventbridge"
          + "env_code"       = "prod"
            # (4 unchanged elements hidden)
        }
        # (10 unchanged attributes hidden)
    }

  # aws_cloudwatch_event_rule.prospect-events_PocketEventBridge-Prod-Prospect-Dismiss-Prod-EventBridge-Rule_event-bridge-rule_758CF81E will be updated in-place
  ~ resource "aws_cloudwatch_event_rule" "prospect-events_PocketEventBridge-Prod-Prospect-Dismiss-Prod-EventBridge-Rule_event-bridge-rule_758CF81E" {
        id                  = "PocketEventBridge-Prod-Shared-Event-Bus/PocketEventBridge-Prod-Prospect-Dismiss-Event-Rule-Rule"
        name                = "PocketEventBridge-Prod-Prospect-Dismiss-Event-Rule-Rule"
        tags                = {}
      ~ tags_all            = {
          + "app_code"       = "pocket-content-shared"
          + "component_code" = "pocket-content-shared-pocketeventbridge"
          + "env_code"       = "prod"
            # (4 unchanged elements hidden)
        }
        # (10 unchanged attributes hidden)
    }

  # aws_cloudwatch_event_rule.prospect-events_PocketEventBridge-Prod-Prospect-Prod-EventBridge-Rule_event-bridge-rule_D94A5C82 will be updated in-place
  ~ resource "aws_cloudwatch_event_rule" "prospect-events_PocketEventBridge-Prod-Prospect-Prod-EventBridge-Rule_event-bridge-rule_D94A5C82" {
        id                  = "PocketEventBridge-Prod-Shared-Event-Bus/PocketEventBridge-Prod-ProspectEvents-Rule-Rule"
        name                = "PocketEventBridge-Prod-ProspectEvents-Rule-Rule"
        tags                = {}
      ~ tags_all            = {
          + "app_code"       = "pocket-content-shared"
          + "component_code" = "pocket-content-shared-pocketeventbridge"
          + "env_code"       = "prod"
            # (4 unchanged elements hidden)
        }
        # (10 unchanged attributes hidden)
    }

  # aws_cloudwatch_event_rule.shareable-list-events_PocketEventBridge-Prod-Shareable-List-EventBridge-Rule_event-bridge-rule_B3E9B53D will be updated in-place
  ~ resource "aws_cloudwatch_event_rule" "shareable-list-events_PocketEventBridge-Prod-Shareable-List-EventBridge-Rule_event-bridge-rule_B3E9B53D" {
        id                  = "PocketEventBridge-Prod-Shared-Event-Bus/PocketEventBridge-Prod-ShareableListEvents-Rule-Rule"
        name                = "PocketEventBridge-Prod-ShareableListEvents-Rule-Rule"
        tags                = {}
      ~ tags_all            = {
          + "app_code"       = "pocket-content-shared"
          + "component_code" = "pocket-content-shared-pocketeventbridge"
          + "env_code"       = "prod"
            # (4 unchanged elements hidden)
        }
        # (10 unchanged attributes hidden)
    }

  # aws_cloudwatch_event_rule.shareable-list-item-events_PocketEventBridge-Prod-Shareable-List-Item-EventBridge-Rule_event-bridge-rule_8124CBA8 will be updated in-place
  ~ resource "aws_cloudwatch_event_rule" "shareable-list-item-events_PocketEventBridge-Prod-Shareable-List-Item-EventBridge-Rule_event-bridge-rule_8124CBA8" {
        id                  = "PocketEventBridge-Prod-Shared-Event-Bus/PocketEventBridge-Prod-ShareableListItemEvents-Rule-Rule"
        name                = "PocketEventBridge-Prod-ShareableListItemEvents-Rule-Rule"
        tags                = 

# ...
# ... The maximum length of GitHub Comment is 65536, so the content is omitted by tfcmt.
# ...

= ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # aws_sns_topic_policy.forgot-password_forgot-password-sns-topic-policy_32893F3B will be updated in-place
  ~ resource "aws_sns_topic_policy" "forgot-password_forgot-password-sns-topic-policy_32893F3B" {
        id     = "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-ForgotPasswordRequest-Topic"
      ~ policy = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sns:Publish"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "events.amazonaws.com"
                        }
                      - Resource  = "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-ForgotPasswordRequest-Topic"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # aws_sns_topic_policy.list-api-events_list-events-sns-topic-policy_59B53E09 will be updated in-place
  ~ resource "aws_sns_topic_policy" "list-api-events_list-events-sns-topic-policy_59B53E09" {
        id     = "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-ListEventTopic"
      ~ policy = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sns:Publish"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "events.amazonaws.com"
                        }
                      - Resource  = "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-ListEventTopic"
                      - Sid       = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # aws_sns_topic_policy.premium-purchase_premium-purchase-sns-topic-policy_DDFFEF7C will be updated in-place
  ~ resource "aws_sns_topic_policy" "premium-purchase_premium-purchase-sns-topic-policy_DDFFEF7C" {
        id     = "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-PremiumPurchase-Topic"
      ~ policy = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sns:Publish"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "events.amazonaws.com"
                        }
                      - Resource  = "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-PremiumPurchase-Topic"
                      - Sid       = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # aws_sns_topic_policy.prospect-events_prospect-events-sns-topic-policy_8C3D6AD1 will be updated in-place
  ~ resource "aws_sns_topic_policy" "prospect-events_prospect-events-sns-topic-policy_8C3D6AD1" {
        id     = "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-ProspectEventTopic"
      ~ policy = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sns:Publish"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "events.amazonaws.com"
                        }
                      - Resource  = "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-ProspectEventTopic"
                      - Sid       = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # aws_sns_topic_policy.shareable-list-events_shareable-list-events-sns-topic-policy_1352CBFE will be updated in-place
  ~ resource "aws_sns_topic_policy" "shareable-list-events_shareable-list-events-sns-topic-policy_1352CBFE" {
        id     = "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-ShareableListEventTopic"
      ~ policy = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sns:Publish"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "events.amazonaws.com"
                        }
                      - Resource  = "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-ShareableListEventTopic"
                      - Sid       = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # aws_sns_topic_policy.shareable-list-item-events_shareable-list-item-events-sns-topic-policy_7C39759F will be updated in-place
  ~ resource "aws_sns_topic_policy" "shareable-list-item-events_shareable-list-item-events-sns-topic-policy_7C39759F" {
        id     = "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-ShareableListItemEventTopic"
      ~ policy = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sns:Publish"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "events.amazonaws.com"
                        }
                      - Resource  = "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-ShareableListItemEventTopic"
                      - Sid       = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # aws_sns_topic_policy.shares-api-events_sharesapi-events-sns-topic-policy_32A6E4FF will be updated in-place
  ~ resource "aws_sns_topic_policy" "shares-api-events_sharesapi-events-sns-topic-policy_32A6E4FF" {
        id     = "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-SharesApiEventTopic"
      ~ policy = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sns:Publish"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "events.amazonaws.com"
                        }
                      - Resource  = "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-SharesApiEventTopic"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # aws_sns_topic_policy.user-api-events_user-events-sns-topic-policy_0B7C8128 will be updated in-place
  ~ resource "aws_sns_topic_policy" "user-api-events_user-events-sns-topic-policy_0B7C8128" {
        id     = "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-UserEventTopic"
      ~ policy = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sns:Publish"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "events.amazonaws.com"
                        }
                      - Resource  = "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-UserEventTopic"
                      - Sid       = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # aws_sns_topic_policy.user-registration_user-registration-events-sns-topic-policy_15EC0C3C will be updated in-place
  ~ resource "aws_sns_topic_policy" "user-registration_user-registration-events-sns-topic-policy_15EC0C3C" {
        id     = "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-UserRegistrationTopic"
      ~ policy = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sns:Publish"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "events.amazonaws.com"
                        }
                      - Resource  = "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-UserRegistrationTopic"
                      - Sid       = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # aws_sqs_queue.adm-events_sns-topic-dql_3950AFFB will be updated in-place
  ~ resource "aws_sqs_queue" "adm-events_sns-topic-dql_3950AFFB" {
        id                                = "https://sqs.us-east-1.amazonaws.com/996905175585/PocketEventBridge-Prod-UserMerge-SNS-Topic-DLQ"
        name                              = "PocketEventBridge-Prod-UserMerge-SNS-Topic-DLQ"
      ~ tags                              = {
          + "app_code"       = "pocket-content-shared"
          + "component_code" = "pocket-content-shared-pocketeventbridge"
            "costCenter"     = "Shared"
          + "env_code"       = "prod"
            "environment"    = "Prod"
            "owner"          = "Pocket"
            "service"        = "PocketEventBridge"
        }
      ~ tags_all                          = {
          + "app_code"       = "pocket-content-shared"
          + "component_code" = "pocket-content-shared-pocketeventbridge"
          + "env_code"       = "prod"
            # (4 unchanged elements hidden)
        }
        # (18 unchanged attributes hidden)
    }

  # aws_sqs_queue.collection-events_sns-topic-dql_48DE5FA3 will be updated in-place
  ~ resource "aws_sqs_queue" "collection-events_sns-topic-dql_48DE5FA3" {
        id                                = "https://sqs.us-east-1.amazonaws.com/996905175585/PocketEventBridge-Prod-SNS-CollectionEvents-Event-Rule-DLQ"
        name                              = "PocketEventBridge-Prod-SNS-CollectionEvents-Event-Rule-DLQ"
      ~ tags                              = {
          + "app_code"       = "pocket-content-shared"
          + "component_code" = "pocket-content-shared-pocketeventbridge"
            "costCenter"     = "Shared"
          + "env_code"       = "prod"
            "environment"    = "Prod"
            "owner"          = "Pocket"
            "service"        = "PocketEventBridge"
        }
      ~ tags_all                          = {
          + "app_code"       = "pocket-content-shared"
          + "component_code" = "pocket-content-shared-pocketeventbridge"
          + "env_code"       = "prod"
            # (4 unchanged elements hidden)
        }
        # (18 unchanged attributes hidden)
    }

  # aws_sqs_queue.forgot-password_sns-topic-dlq_A55BE032 will be updated in-place
  ~ resource "aws_sqs_queue" "forgot-password_sns-topic-dlq_A55BE032" {
        id                                = "https://sqs.us-east-1.amazonaws.com/996905175585/PocketEventBridge-Prod-ForgotPasswordRequest-SNS-Topic-Event-Rule-DLQ"
        name                              = "PocketEventBridge-Prod-ForgotPasswordRequest-SNS-Topic-Event-Rule-DLQ"
      ~ tags                              = {
          + "app_code"       = "pocket-content-shared"
          + "component_code" = "pocket-content-shared-pocketeventbridge"
            "costCenter"     = "Shared"
          + "env_code"       = "prod"
            "environment"    = "Prod"
            "owner"          = "Pocket"
            "service"        = "PocketEventBridge"
        }
      ~ tags_all                          = {
          + "app_code"       = "pocket-content-shared"
          + "component_code" = "pocket-content-shared-pocketeventbridge"
          + "env_code"       = "prod"
            # (4 unchanged elements hidden)
        }
        # (18 unchanged attributes hidden)
    }

  # aws_sqs_queue.list-api-events_sns-topic-dql_ED0C2F54 will be updated in-place
  ~ resource "aws_sqs_queue" "list-api-events_sns-topic-dql_ED0C2F54" {
        id                                = "https://sqs.us-east-1.amazonaws.com/996905175585/PocketEventBridge-Prod-ListApiEvents-Topic-Rule-DLQ"
        name                              = "PocketEventBridge-Prod-ListApiEvents-Topic-Rule-DLQ"
      ~ tags                              = {
          + "app_code"       = "pocket-content-shared"
          + "component_code" = "pocket-content-shared-pocketeventbridge"
            "costCenter"     = "Shared"
          + "env_code"       = "prod"
            "environment"    = "Prod"
            "owner"          = "Pocket"
            "service"        = "PocketEventBridge"
        }
      ~ tags_all                          = {
          + "app_code"       = "pocket-content-shared"
          + "component_code" = "pocket-content-shared-pocketeventbridge"
          + "env_code"       = "prod"
            # (4 unchanged elements hidden)
        }
        # (18 unchanged attributes hidden)
    }

  # aws_sqs_queue.premium-purchase_sns-topic-dlq_2D01673E will be updated in-place
  ~ resource "aws_sqs_queue" "premium-purchase_sns-topic-dlq_2D01673E" {
        id                                = "https://sqs.us-east-1.amazonaws.com/996905175585/PocketEventBridge-Prod-PremiumPurchase-SNS-Topic-Event-Rule-DLQ"
        name                              = "PocketEventBridge-Prod-PremiumPurchase-SNS-Topic-Event-Rule-DLQ"
      ~ tags                              = {
          + "app_code"       = "pocket-content-shared"
          + "component_code" = "pocket-content-shared-pocketeventbridge"
            "costCenter"     = "Shared"
          + "env_code"       = "prod"
            "environment"    = "Prod"
            "owner"          = "Pocket"
            "service"        = "PocketEventBridge"
        }
      ~ tags_all                          = {
          + "app_code"       = "pocket-content-shared"
          + "component_code" = "pocket-content-shared-pocketeventbridge"
          + "env_code"       = "prod"
            # (4 unchanged elements hidden)
        }
        # (18 unchanged attributes hidden)
    }

  # aws_sqs_queue.shareable-list-events_sns-topic-dql_91DFF5B3 will be updated in-place
  ~ resource "aws_sqs_queue" "shareable-list-events_sns-topic-dql_91DFF5B3" {
        id                                = "https://sqs.us-east-1.amazonaws.com/996905175585/PocketEventBridge-Prod-SNS-ShareableListEvents-Topic-DLQ"
        name                              = "PocketEventBridge-Prod-SNS-ShareableListEvents-Topic-DLQ"
      ~ tags                              = {
          + "app_code"       = "pocket-content-shared"
          + "component_code" = "pocket-content-shared-pocketeventbridge"
            "costCenter"     = "Shared"
          + "env_code"       = "prod"
            "environment"    = "Prod"
            "owner"          = "Pocket"
            "service"        = "PocketEventBridge"
        }
      ~ tags_all                          = {
          + "app_code"       = "pocket-content-shared"
          + "component_code" = "pocket-content-shared-pocketeventbridge"
          + "env_code"       = "prod"
            # (4 unchanged elements hidden)
        }
        # (18 unchanged attributes hidden)
    }

  # aws_sqs_queue.shareable-list-item-events_sns-topic-dql_44435A2F will be updated in-place
  ~ resource "aws_sqs_queue" "shareable-list-item-events_sns-topic-dql_44435A2F" {
        id                                = "https://sqs.us-east-1.amazonaws.com/996905175585/PocketEventBridge-Prod-SNS-ShareableListItemEvents-Topic-DLQ"
        name                              = "PocketEventBridge-Prod-SNS-ShareableListItemEvents-Topic-DLQ"
      ~ tags                              = {
          + "app_code"       = "pocket-content-shared"
          + "component_code" = "pocket-content-shared-pocketeventbridge"
            "costCenter"     = "Shared"
          + "env_code"       = "prod"
            "environment"    = "Prod"
            "owner"          = "Pocket"
            "service"        = "PocketEventBridge"
        }
      ~ tags_all                          = {
          + "app_code"       = "pocket-content-shared"
          + "component_code" = "pocket-content-shared-pocketeventbridge"
          + "env_code"       = "prod"
            # (4 unchanged elements hidden)
        }
        # (18 unchanged attributes hidden)
    }

  # aws_sqs_queue.shares-api-events_sns-topic-dql_E0EEF171 will be updated in-place
  ~ resource "aws_sqs_queue" "shares-api-events_sns-topic-dql_E0EEF171" {
        id                                = "https://sqs.us-east-1.amazonaws.com/996905175585/PocketEventBridge-Prod-SNS-SharesApiEvents-Topic-DLQ"
        name                              = "PocketEventBridge-Prod-SNS-SharesApiEvents-Topic-DLQ"
      ~ tags                              = {
          + "app_code"       = "pocket-content-shared"
          + "component_code" = "pocket-content-shared-pocketeventbridge"
            "costCenter"     = "Shared"
          + "env_code"       = "prod"
            "environment"    = "Prod"
            "owner"          = "Pocket"
            "service"        = "PocketEventBridge"
        }
      ~ tags_all                          = {
          + "app_code"       = "pocket-content-shared"
          + "component_code" = "pocket-content-shared-pocketeventbridge"
          + "env_code"       = "prod"
            # (4 unchanged elements hidden)
        }
        # (18 unchanged attributes hidden)
    }

  # aws_sqs_queue.user-api-events_sns-topic-dql_D6161F53 will be updated in-place
  ~ resource "aws_sqs_queue" "user-api-events_sns-topic-dql_D6161F53" {
        id                                = "https://sqs.us-east-1.amazonaws.com/996905175585/PocketEventBridge-Prod-UserEvents-Topic-Rule-DLQ"
        name                              = "PocketEventBridge-Prod-UserEvents-Topic-Rule-DLQ"
      ~ tags                              = {
          + "app_code"       = "pocket-content-shared"
          + "component_code" = "pocket-content-shared-pocketeventbridge"
            "costCenter"     = "Shared"
          + "env_code"       = "prod"
            "environment"    = "Prod"
            "owner"          = "Pocket"
            "service"        = "PocketEventBridge"
        }
      ~ tags_all                          = {
          + "app_code"       = "pocket-content-shared"
          + "component_code" = "pocket-content-shared-pocketeventbridge"
          + "env_code"       = "prod"
            # (4 unchanged elements hidden)
        }
        # (18 unchanged attributes hidden)
    }

  # aws_sqs_queue.user-registration_sns-topic-dql_811A5411 will be updated in-place
  ~ resource "aws_sqs_queue" "user-registration_sns-topic-dql_811A5411" {
        id                                = "https://sqs.us-east-1.amazonaws.com/996905175585/PocketEventBridge-Prod-SNS-UserRegistration-Topic--DLQ"
        name                              = "PocketEventBridge-Prod-SNS-UserRegistration-Topic--DLQ"
      ~ tags                              = {
          + "app_code"       = "pocket-content-shared"
          + "component_code" = "pocket-content-shared-pocketeventbridge"
            "costCenter"     = "Shared"
          + "env_code"       = "prod"
            "environment"    = "Prod"
            "owner"          = "Pocket"
            "service"        = "PocketEventBridge"
        }
      ~ tags_all                          = {
          + "app_code"       = "pocket-content-shared"
          + "component_code" = "pocket-content-shared-pocketeventbridge"
          + "env_code"       = "prod"
            # (4 unchanged elements hidden)
        }
        # (18 unchanged attributes hidden)
    }

Plan: 0 to add, 67 to change, 0 to destroy.
```

</details>









<!-- github-comment: {"Command":"plan","JobID":"8cbdf0b5-c2bb-4f7e-86bd-92bb1b25f78a","JobName":"pocket-event-bridge_infrastructure_plan_prod","PRNumber":572,"Program":"tfcmt","SHA1":"8cce0ef636735b4f73d5efb2fde7796641120371","Target":"pocket-event-bridge-cdk","Vars":{}} -->